Tekla Open API Reference for Tekla Structures 2025
DetailMark.DetailMarkAttributes Class
 The DetailMarkAttributes class is the attributes class for detail marks.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class DetailMarkAttributes : AttributesBase
<SerializableAttribute>
Public NotInheritable Class DetailMarkAttributes
	Inherits AttributesBase
The DetailMark.DetailMarkAttributes type exposes the following members.
Constructors
Name | Description
DetailMark.DetailMarkAttributes()
 Creates a new default DetailMarkAttributes instance that loads standard attributes.
DetailMark.DetailMarkAttributes(String)
 Creates a new DetailMarkAttributes instance that loads the specified attributes.
Top
Properties
Name | Description
BoundaryLineColor |  Obsolete.
BoundaryLineType |  Obsolete.
BoundaryShape
 The detail mark boundary shape.
BoundingLine
 Gets or sets the line type.
MarkName
 The detail mark name.
MarkSymbolAttributes
 The detail mark symbol attributes.
MarkSymbolColor
TagsAttributes
 The attributes for detail mark tags.
TrueMarkSymbolColor
 The true color (rgb enabled) of the detail mark symbol.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace